# =============================================================================
# Homebrew Bundle - Core Development Tools
# =============================================================================
# This Brewfile contains lightweight CLI tools and essential utilities.
# Large GUI applications are in Brewfile.casks (install separately).
# =============================================================================

# -----------------------------------------------------------------------------
# Shell & Prompt
# -----------------------------------------------------------------------------
brew "starship"      # Modern prompt
brew "atuin"         # Shell history sync & search
brew "carapace"      # Advanced shell completions
brew "zoxide"        # Smart directory jumper
brew "fzf"           # Fuzzy finder
brew "direnv"        # Per-directory environment variables

# -----------------------------------------------------------------------------
# Modern Unix Replacements
# -----------------------------------------------------------------------------
brew "ripgrep"       # Fast code search (grep)
brew "fd"            # Fast file finder (find)
brew "bat"           # Syntax-highlighted cat
brew "eza"           # Modern ls
brew "sd"            # Modern sed
brew "procs"         # Modern ps with colors

# -----------------------------------------------------------------------------
# Git Tools
# -----------------------------------------------------------------------------
brew "git"           # Version control
brew "git-delta"     # Better git diff viewer
brew "difftastic"    # Structural diff tool (for lazygit)
brew "gh"            # GitHub CLI
brew "lazygit"       # Git TUI (Vim keybindings)

# -----------------------------------------------------------------------------
# Docker Tools
# -----------------------------------------------------------------------------
brew "lazydocker"    # Docker TUI

# -----------------------------------------------------------------------------
# JSON Tools
# -----------------------------------------------------------------------------
brew "jq"            # JSON processor
brew "jaq"           # jq clone in Rust (faster)
brew "fx"            # Interactive JSON viewer
brew "jless"         # JSON pager with vim keybindings
brew "jnv"           # Interactive JSON filter

# -----------------------------------------------------------------------------
# Data Tools
# -----------------------------------------------------------------------------
brew "visidata"      # Terminal spreadsheet viewer
brew "qsv"           # Fast CSV toolkit
brew "lnav"          # Log file navigator

# -----------------------------------------------------------------------------
# File & Media Tools
# -----------------------------------------------------------------------------
brew "yazi"          # Terminal file manager
brew "ffmpeg"        # Video/audio processing
brew "sevenzip"      # 7z archive tool
brew "poppler"       # PDF rendering library
brew "imagemagick"   # Image processing
brew "resvg"         # SVG renderer

# -----------------------------------------------------------------------------
# HTTP/Network Tools
# -----------------------------------------------------------------------------
brew "xh"            # httpie clone in Rust (faster)
brew "gping"         # Ping with graph
brew "bore-cli"      # Tunnel localhost to public URL

# -----------------------------------------------------------------------------
# Clean Tools
# -----------------------------------------------------------------------------
brew "mole"          # Clean tool

# -----------------------------------------------------------------------------
# Development Tools
# -----------------------------------------------------------------------------
brew "ast-grep"      # Code search/rewrite by AST
brew "hyperfine"     # Command-line benchmarking
brew "tldr"          # Simplified man pages

# -----------------------------------------------------------------------------
# System Monitoring
# -----------------------------------------------------------------------------
brew "btop"          # Modern system monitor

# -----------------------------------------------------------------------------
# Security
# -----------------------------------------------------------------------------
brew "age"           # File encryption

# -----------------------------------------------------------------------------
# Python Development (uv + FastAPI)
# -----------------------------------------------------------------------------
brew "python@3.12"
brew "uv"            # Fast Python package/project manager (replaces pip/poetry/pyenv)
brew "ruff"          # Fast Python linter/formatter

# -----------------------------------------------------------------------------
# Node.js Development
# -----------------------------------------------------------------------------
brew "node"          # Node.js runtime
brew "pnpm"          # Fast, disk space efficient package manager

# -----------------------------------------------------------------------------
# Editor / IDE
# -----------------------------------------------------------------------------
brew "neovim"        # Modern Vim
brew "duti"          # Set default file associations

# -----------------------------------------------------------------------------
# Terminal
# -----------------------------------------------------------------------------
brew "zellij"        # Modern terminal multiplexer (Rust, better UX than tmux)

# -----------------------------------------------------------------------------
# Fonts
# -----------------------------------------------------------------------------
cask "font-lilex-nerd-font"

# =============================================================================
# NOTE: Large GUI applications (Ghostty, Zed, etc.) are in Brewfile.casks
# To install: brew bundle --file=~/.config/brew/Brewfile.casks
# =============================================================================
